**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [1]:
import pandas as pd
import numpy as np

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age':  [3.5, 4, 1.5, 'np.nan', 6, 3, 5.5, 'np.nan', 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

birds_df = pd.DataFrame.from_dict(data)



print(birds_df)

      age       birds priority  visits
0     3.5      Cranes      yes       2
1       4      Cranes      yes       4
2     1.5     plovers       no       3
3  np.nan  spoonbills      yes       4
4       6  spoonbills       no       3
5       3      Cranes       no       4
6     5.5     plovers       no       2
7  np.nan      Cranes      yes       2
8       8  spoonbills       no       3
9       4  spoonbills       no       2

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [2]:
print(birds_df.describe())

birds_df['birds']

          visits
count  10.000000
mean    2.900000
std     0.875595
min     2.000000
25%     2.000000
50%     3.000000
75%     3.750000
max     4.000000

0        Cranes
1        Cranes
2       plovers
3    spoonbills
4    spoonbills
5        Cranes
6       plovers
7        Cranes
8    spoonbills
9    spoonbills
Name: birds, dtype: object

**3. Print the first 2 rows of the birds dataframe **

In [3]:
print(birds_df.head(2))

   age   birds priority  visits
0  3.5  Cranes      yes       2
1    4  Cranes      yes       4

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [4]:

birds_df[['birds','age']]

        birds     age
0      Cranes     3.5
1      Cranes       4
2     plovers     1.5
3  spoonbills  np.nan
4  spoonbills       6
5      Cranes       3
6     plovers     5.5
7      Cranes  np.nan
8  spoonbills       8
9  spoonbills       4

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [5]:
birds_df[['birds','age','visits']].iloc[[2,3,7]]

        birds     age  visits
2     plovers     1.5       3
3  spoonbills  np.nan       4
7      Cranes  np.nan       2

**6. select the rows where the number of visits is less than 4**

In [6]:
birds_df[birds_df.visits < 4 ]

      age       birds priority  visits
0     3.5      Cranes      yes       2
2     1.5     plovers       no       3
4       6  spoonbills       no       3
6     5.5     plovers       no       2
7  np.nan      Cranes      yes       2
8       8  spoonbills       no       3
9       4  spoonbills       no       2

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [7]:
birds_df[birds_df.age == 'np.nan' ]

      age       birds priority  visits
3  np.nan  spoonbills      yes       4
7  np.nan      Cranes      yes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [8]:

birds_df.age = pd.to_numeric(birds_df.age, errors='coerce')

birds_df.age = pd.to_numeric(birds_df.age, errors='coerce').fillna(0).astype(np.int64)


print(birds_df[(birds_df.birds == 'Cranes') &  (birds_df.age.astype(int) < 4)])

   age   birds priority  visits
0    3  Cranes      yes       2
5    3  Cranes       no       4
7    0  Cranes      yes       2

**9. Select the rows the age is between 2 and 4(inclusive)**

In [9]:

birds_df.age = pd.to_numeric(birds_df.age, errors='coerce')

birds_df.age = pd.to_numeric(birds_df.age, errors='coerce').fillna(0).astype(np.int64)

print(birds_df[(birds_df.age.astype(int) > 2) & (birds_df.age.astype(int) <= 4)])

   age       birds priority  visits
0    3      Cranes      yes       2
1    4      Cranes      yes       4
5    3      Cranes       no       4
9    4  spoonbills       no       2

**10. Find the total number of visits of the bird Cranes**

In [10]:
visits_total = birds_df[birds_df.birds == 'Cranes']['visits'].sum()
print("Total number of Crane bird visits :",visits_total)

Total number of Crane bird visits : 12

**11. Calculate the mean age for each different birds in dataframe.**

In [35]:
bird_mean = birds_df.groupby(['birds']).mean()
print(bird_mean)

            age  visits
birds
Cranes      2.5     3.0
Sparrow     2.0     3.0
plovers     3.0     2.5
spoonbills  4.5     3.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [54]:
birds_df1 = pd.DataFrame(pd.DataFrame.from_dict(new_data), index=['k'])


birds_df = birds_df.append(birds_df1)

birds_df.loc['k'] = [2,'Sparrow','yes',3]



print(birds_df)

   age       birds priority  visits
1  4.0      Cranes      yes     4.0
2  1.0     plovers       no     3.0
3  0.0  spoonbills      yes     4.0
4  6.0  spoonbills       no     3.0
5  3.0      Cranes       no     4.0
6  5.0     plovers       no     2.0
7  0.0      Cranes      yes     2.0
8  8.0  spoonbills       no     3.0
9  4.0  spoonbills       no     2.0
k  2.0     Sparrow      yes     3.0

In [57]:
birds_df = birds_df.drop('k')
print(birds_df)

   age       birds priority  visits
1  4.0      Cranes      yes     4.0
2  1.0     plovers       no     3.0
3  0.0  spoonbills      yes     4.0
4  6.0  spoonbills       no     3.0
5  3.0      Cranes       no     4.0
6  5.0     plovers       no     2.0
7  0.0      Cranes      yes     2.0
8  8.0  spoonbills       no     3.0
9  4.0  spoonbills       no     2.0

**13. Find the number of each type of birds in dataframe (Counts)**

In [58]:
bird_type = birds_df.groupby(['birds']).size()

print(bird_type)

birds
Cranes        3
plovers       2
spoonbills    4
dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [59]:
print(birds_df.sort_values('age',ascending=False))
print("********************************************")
print(birds_df.sort_values('visits',ascending=True))

   age       birds priority  visits
8  8.0  spoonbills       no     3.0
4  6.0  spoonbills       no     3.0
6  5.0     plovers       no     2.0
1  4.0      Cranes      yes     4.0
9  4.0  spoonbills       no     2.0
5  3.0      Cranes       no     4.0
2  1.0     plovers       no     3.0
3  0.0  spoonbills      yes     4.0
7  0.0      Cranes      yes     2.0
********************************************
   age       birds priority  visits
6  5.0     plovers       no     2.0
7  0.0      Cranes      yes     2.0
9  4.0  spoonbills       no     2.0
2  1.0     plovers       no     3.0
4  6.0  spoonbills       no     3.0
8  8.0  spoonbills       no     3.0
1  4.0      Cranes      yes     4.0
3  0.0  spoonbills      yes     4.0
5  3.0      Cranes       no     4.0

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [60]:
priority_yes = birds_df.replace({'priority':['yes']},1)
#print(priority_yes)

priority_no = priority_yes.replace({'priority':['no']},0)
print(priority_no)

   age       birds  priority  visits
1  4.0      Cranes         1     4.0
2  1.0     plovers         0     3.0
3  0.0  spoonbills         1     4.0
4  6.0  spoonbills         0     3.0
5  3.0      Cranes         0     4.0
6  5.0     plovers         0     2.0
7  0.0      Cranes         1     2.0
8  8.0  spoonbills         0     3.0
9  4.0  spoonbills         0     2.0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [61]:
trumpeters = birds_df.replace({'birds':['Cranes']},'trumpeters')

print(trumpeters)

   age       birds priority  visits
1  4.0  trumpeters      yes     4.0
2  1.0     plovers       no     3.0
3  0.0  spoonbills      yes     4.0
4  6.0  spoonbills       no     3.0
5  3.0  trumpeters       no     4.0
6  5.0     plovers       no     2.0
7  0.0  trumpeters      yes     2.0
8  8.0  spoonbills       no     3.0
9  4.0  spoonbills       no     2.0